export const mockQuizzes = {
  quiz: {
    multipleChoice: [
      {
        question: 'การเสาะหาข้อมูลของผู้บริโภคหมายถึงอะไร?',
        choice: [
          'การซื้อสินค้าหรือบริการ',
          'การรวบรวมข้อมูลเกี่ยวกับผลิตภัณฑ์และแบรนด์',
          'การใช้สินค้าหรือบริการ',
          'การตัดสินใจซื้อสินค้าหรือบริการ',
          'การประเมินผลสินค้าหรือบริการ',
        ],
        correctAnswer: 'การรวบรวมข้อมูลเกี่ยวกับผลิตภัณฑ์และแบรนด์',
        explanation:
          'การเสาะหาข้อมูลของผู้บริโภค คือ กระบวนการที่ผู้บริโภคใช้ในการรวบรวมข้อมูลเกี่ยวกับผลิตภัณฑ์และแบรนด์ เพื่อช่วยในการตัดสินใจซื้อ',
      },
      {
        question: 'ผู้บริโภคมีแนวโน้มที่จะเสาะหาข้อมูลมากขึ้น เมื่อใด?',
        choice: [
          'เมื่อมีความต้องการสินค้าหรือบริการที่ชัดเจน',
          'เมื่อมีความเสี่ยงที่รับรู้สูง',
          'เมื่อมีความรู้และประสบการณ์เกี่ยวกับผลิตภัณฑ์น้อย',
          'ทั้งหมดข้างต้น',
          'ไม่มีข้อใดถูก',
        ],
        correctAnswer: 'ทั้งหมดข้างต้น',
        explanation:
          'ผู้บริโโภคมีแนวโน้มที่จะเสาะหาข้อมูลมากขึ้น เมื่อ* มีความต้องการสินค้าหรือบริการที่ชัดเจน มีความเสี่ยงที่รับรู้สูง มีความรู้และประสบการณ์เกี่ยวกับผลิตภัณฑ์น้อย',
      },
      {
        question: 'แหล่งที่มาของข้อมูลใด ที่ผู้ขายควบคุม?',
        choice: [
          'การบอกต่อ',
          'รีวิวออนไลน์',
          'พนักงานขาย',
          'รายงานผู้บริโภค',
          'บทความข่าว',
        ],
        correctAnswer: 'พนักงานขาย',
        explanation:
          'พนักงานขาย เป็นแหล่งที่มาของข้อมูลที่ผู้ขายควบคุม เพราะพนักงานขายได้รับการฝึกฝนให้ให้ข้อมูลเกี่ยวกับผลิตภัณฑ์และแบรนด์ ตามที่ผู้ขายต้องการ',
      },
      {
        question:
          'การเสาะหาข้อมูลแบบใด ที่มุ่งเน้นไปที่ประสบการณ์ทางประสาทสัมผัสและอารมณ์ของผู้บริโภค?',
        choice: [
          'การเสาะหาข้อมูลอย่างต่อเนื่อง',
          'การเสาะหาข้อมูลเฉพาะเจาะจง',
          'การเสาะหาข้อมูลที่ไม่เจาะจง',
          'การรับข้อมูลแบบพาสซีฟ',
          'การเสาะหาข้อมูลแบบมุ่งเน้นความสุข',
        ],
        correctAnswer: 'การเสาะหาข้อมูลแบบมุ่งเน้นความสุข',
        explanation:
          'การเสาะหาข้อมูลแบบมุ่งเน้นความสุข มุ่งเน้นไปที่ประสบการณ์ทางประสาทสัมผัสและอารมณ์ของผู้บริโภค โดยใช้ภาพ เสียง และภาพที่น่าสนใจเพื่อสร้างความสัมพันธ์เชิงบวกกับผลิตภัณฑ์',
      },
      {
        question: 'ปัจจัยใด ที่ไม่มีผลต่อการเสาะหาข้อมูลของผู้บริโภค?',
        choice: [
          'ความสนใจของผู้บริโภค',
          'เวลา',
          'ราคา',
          'ความรู้และประสบการณ์',
          'ความต้องการของผู้อื่น',
        ],
        correctAnswer: 'ความต้องการของผู้อื่น',
        explanation:
          'ความต้องการของผู้อื่น ไม่มีผลต่อการเสาะหาข้อมูลของผู้บริโภค เพราะการเสาะหาข้อมูลของผู้บริโภค ขึ้นอยู่กับความต้องการและความชอบของผู้บริโภคเอง',
      },
    ],
    openEnded: [
      {
        question:
          'ยกตัวอย่าง แหล่งที่มาของข้อมูล ที่ผู้บริโภคใช้ในการเสาะหาข้อมูล เกี่ยวกับผลิตภัณฑ์ที่ผู้บริโภคให้ความสนใจสูง',
        answer:
          '**แหล่งที่มาของข้อมูล ที่ผู้บริโภคใช้ในการเสาะหาข้อมูล เกี่ยวกับผลิตภัณฑ์ที่ผู้บริโภคให้ความสนใจสูง*** เว็บไซต์ของแบรนด์* รีวิวออนไลน์* บทความข่าว* การบอกต่อวิดีโอรีวิวพนักงานขายโฆษณา',
      },
    ],
  },
}
